nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/mcuxpresso/startup_mimxrt798s_cm33_core0.cpp
//*****************************************************************************
// MIMXRT798S_cm33_core0 startup code for use with MCUXpresso IDE
//
// Version : 280524
//*****************************************************************************
//
// Copyright 2016-2024 NXP
// All rights reserved.
//
// SPDX-License-Identifier: BSD-3-Clause
//*****************************************************************************

#if defined (DEBUG)
#pragma GCC push_options
#pragma GCC optimize ("Og")
#endif // (DEBUG)

#if defined (__cplusplus)
#ifdef __REDLIB__
#error Redlib does not support C++
#else
//*****************************************************************************
//
// The entry point for the C++ library startup
//
//*****************************************************************************
extern "C" {
    extern void __libc_init_array(void);
}
#endif
#endif

#define WEAK __attribute__ ((weak))
#define WEAK_AV __attribute__ ((weak, section(".after_vectors")))
#define ALIAS(f) __attribute__ ((weak, alias (#f)))

//*****************************************************************************
#if defined (__cplusplus)
extern "C" {
#endif

//*****************************************************************************
// Variable to store CRP value in. Will be placed automatically
// by the linker when "Enable Code Read Protect" selected.
// See crp.h header for more information
//*****************************************************************************
//*****************************************************************************
// Declaration of external SystemInit function
//*****************************************************************************
#if defined (__USE_CMSIS)
extern void SystemInit(void);
#endif // (__USE_CMSIS)

//*****************************************************************************
// Forward declaration of the core exception handlers.
// When the application defines a handler (with the same name), this will
// automatically take precedence over these weak definitions.
// If your application is a C++ one, then any interrupt handlers defined
// in C++ files within in your main application will need to have C linkage
// rather than C++ linkage. To do this, make sure that you are using extern "C"
// { .... } around the interrupt handler within your main application code.
//*****************************************************************************
     void ResetISR(void);
WEAK void NMI_Handler(void);
WEAK void HardFault_Handler(void);
WEAK void MemManage_Handler(void);
WEAK void BusFault_Handler(void);
WEAK void UsageFault_Handler(void);
WEAK void SecureFault_Handler(void);
WEAK void SVC_Handler(void);
WEAK void DebugMon_Handler(void);
WEAK void PendSV_Handler(void);
WEAK void SysTick_Handler(void);
WEAK void IntDefaultHandler(void);

//*****************************************************************************
// Forward declaration of the application IRQ handlers. When the application
// defines a handler (with the same name), this will automatically take
// precedence over weak definitions below
//*****************************************************************************
WEAK void Reserved16_IRQHandler(void);
WEAK void UTICK0_IRQHandler(void);
WEAK void MRT0_IRQHandler(void);
WEAK void CTIMER0_IRQHandler(void);
WEAK void CTIMER1_IRQHandler(void);
WEAK void SCT0_IRQHandler(void);
WEAK void CTIMER3_IRQHandler(void);
WEAK void LP_FLEXCOMM0_IRQHandler(void);
WEAK void LP_FLEXCOMM1_IRQHandler(void);
WEAK void LP_FLEXCOMM2_IRQHandler(void);
WEAK void LP_FLEXCOMM3_IRQHandler(void);
WEAK void LP_FLEXCOMM4_IRQHandler(void);
WEAK void LP_FLEXCOMM5_IRQHandler(void);
WEAK void LPSPI14_IRQHandler(void);
WEAK void LPI2C15_IRQHandler(void);
WEAK void ADC_IRQHandler(void);
WEAK void SDADC_IRQHandler(void);
WEAK void ACMP_IRQHandler(void);
WEAK void PDM_EVENT_IRQHandler(void);
WEAK void PDM_HWVAD_EVENT_IRQHandler(void);
WEAK void HYPERVISOR_IRQHandler(void);
WEAK void SECURE_VIOLATION_IRQHandler(void);
WEAK void SENSE_HYPERVISOR_IRQHandler(void);
WEAK void SENSE_SECURE_VIOLATION_IRQHandler(void);
WEAK void MEDIA_HYPERVISOR_IRQHandler(void);
WEAK void MEDIA_SECURE_VIOLATION_IRQHandler(void);
WEAK void RTC0_ALARM_IRQHandler(void);
WEAK void RTC0_IRQHandler(void);
WEAK void HIFI4_IRQHandler(void);
WEAK void MU0_A_IRQHandler(void);
WEAK void MU1_A_IRQHandler(void);
WEAK void MU4_A_IRQHandler(void);
WEAK void CTIMER2_IRQHandler(void);
WEAK void CTIMER4_IRQHandler(void);
WEAK void OS_EVENT_IRQHandler(void);
WEAK void LP_FLEXCOMM6_IRQHandler(void);
WEAK void LP_FLEXCOMM7_IRQHandler(void);
WEAK void USDHC0_IRQHandler(void);
WEAK void USDHC1_IRQHandler(void);
WEAK void I3C0_IRQHandler(void);
WEAK void USB0_IRQHandler(void);
WEAK void USB1_IRQHandler(void);
WEAK void WDT0_IRQHandler(void);
WEAK void WDT1_IRQHandler(void);
WEAK void USBPHY0_IRQHandler(void);
WEAK void PUF_IRQHandler(void);
WEAK void PMIC_IRQN_IRQHandler(void);
WEAK void LP_FLEXCOMM8_IRQHandler(void);
WEAK void LP_FLEXCOMM9_IRQHandler(void);
WEAK void LP_FLEXCOMM10_IRQHandler(void);
WEAK void LP_FLEXCOMM11_IRQHandler(void);
WEAK void LP_FLEXCOMM12_IRQHandler(void);
WEAK void LP_FLEXCOMM13_IRQHandler(void);
WEAK void LPSPI16_IRQHandler(void);
WEAK void I3C1_IRQHandler(void);
WEAK void FLEXIO_IRQHandler(void);
WEAK void LCDIF_IRQHandler(void);
WEAK void VGPU_IRQHandler(void);
WEAK void MIPI_IRQHandler(void);
WEAK void EDMA0_CH0_IRQHandler(void);
WEAK void EDMA0_CH1_IRQHandler(void);
WEAK void EDMA0_CH2_IRQHandler(void);
WEAK void EDMA0_CH3_IRQHandler(void);
WEAK void EDMA0_CH4_IRQHandler(void);
WEAK void EDMA0_CH5_IRQHandler(void);
WEAK void EDMA0_CH6_IRQHandler(void);
WEAK void EDMA0_CH7_IRQHandler(void);
WEAK void EDMA0_CH8_IRQHandler(void);
WEAK void EDMA0_CH9_IRQHandler(void);
WEAK void EDMA0_CH10_IRQHandler(void);
WEAK void EDMA0_CH11_IRQHandler(void);
WEAK void EDMA0_CH12_IRQHandler(void);
WEAK void EDMA0_CH13_IRQHandler(void);
WEAK void EDMA0_CH14_IRQHandler(void);
WEAK void EDMA0_CH15_IRQHandler(void);
WEAK void EDMA1_CH0_IRQHandler(void);
WEAK void EDMA1_CH1_IRQHandler(void);
WEAK void EDMA1_CH2_IRQHandler(void);
WEAK void EDMA1_CH3_IRQHandler(void);
WEAK void EDMA1_CH4_IRQHandler(void);
WEAK void EDMA1_CH5_IRQHandler(void);
WEAK void EDMA1_CH6_IRQHandler(void);
WEAK void EDMA1_CH7_IRQHandler(void);
WEAK void EDMA1_CH8_IRQHandler(void);
WEAK void EDMA1_CH9_IRQHandler(void);
WEAK void EDMA1_CH10_IRQHandler(void);
WEAK void EDMA1_CH11_IRQHandler(void);
WEAK void EDMA1_CH12_IRQHandler(void);
WEAK void EDMA1_CH13_IRQHandler(void);
WEAK void EDMA1_CH14_IRQHandler(void);
WEAK void EDMA1_CH15_IRQHandler(void);
WEAK void GPIO00_IRQHandler(void);
WEAK void GPIO01_IRQHandler(void);
WEAK void GPIO10_IRQHandler(void);
WEAK void GPIO11_IRQHandler(void);
WEAK void GPIO20_IRQHandler(void);
WEAK void GPIO21_IRQHandler(void);
WEAK void GPIO30_IRQHandler(void);
WEAK void GPIO31_IRQHandler(void);
WEAK void GPIO40_IRQHandler(void);
WEAK void GPIO41_IRQHandler(void);
WEAK void GPIO50_IRQHandler(void);
WEAK void GPIO51_IRQHandler(void);
WEAK void GPIO60_IRQHandler(void);
WEAK void GPIO61_IRQHandler(void);
WEAK void GPIO70_IRQHandler(void);
WEAK void GPIO71_IRQHandler(void);
WEAK void PIN_INT0_IRQHandler(void);
WEAK void PIN_INT1_IRQHandler(void);
WEAK void PIN_INT2_IRQHandler(void);
WEAK void PIN_INT3_IRQHandler(void);
WEAK void PIN_INT4_IRQHandler(void);
WEAK void PIN_INT5_IRQHandler(void);
WEAK void PIN_INT6_IRQHandler(void);
WEAK void PIN_INT7_IRQHandler(void);
WEAK void SAI0_IRQHandler(void);
WEAK void SAI1_IRQHandler(void);
WEAK void SAI2_IRQHandler(void);
WEAK void XSPI0_IRQHandler(void);
WEAK void XSPI1_IRQHandler(void);
WEAK void XSPI2_IRQHandler(void);
WEAK void MMU0_IRQHandler(void);
WEAK void MMU1_IRQHandler(void);
WEAK void MMU2_IRQHandler(void);
WEAK void Freqme_IRQHandler(void);
WEAK void GDET0_IRQHandler(void);
WEAK void GDET1_IRQHandler(void);
WEAK void GDET2_IRQHandler(void);
WEAK void GDET3_IRQHandler(void);
WEAK void CDOG0_IRQHandler(void);
WEAK void CDOG1_IRQHandler(void);
WEAK void CDOG2_IRQHandler(void);
WEAK void ITRC0_IRQHandler(void);
WEAK void ELS_IRQHandler(void);
WEAK void PKC_IRQHandler(void);
WEAK void OSCCA_IRQHandler(void);
WEAK void SLEEPCON0_IRQHandler(void);
WEAK void CPU0_IRQHandler(void);
WEAK void PMC_IRQHandler(void);
WEAK void JPEGDEC_IRQHandler(void);
WEAK void PNGDEC_IRQHandler(void);
WEAK void NPU_IRQHandler(void);
WEAK void TRNG_IRQHandler(void);
WEAK void TEMPDET0_IRQHandler(void);
WEAK void TEMPDET1_IRQHandler(void);
WEAK void EZHV_IRQHandler(void);
WEAK void GLIKEY0_IRQHandler(void);
WEAK void GLIKEY2_IRQHandler(void);
WEAK void GLIKEY3_IRQHandler(void);
WEAK void GLIKEY5_IRQHandler(void);
WEAK void PVTS0_CPU0_IRQHandler(void);
WEAK void Reserved167_IRQHandler(void);
WEAK void PVTS0_HIFI4_IRQHandler(void);
WEAK void Reserved169_IRQHandler(void);
WEAK void FRO0_IRQHandler(void);
WEAK void FRO1_IRQHandler(void);
WEAK void FRO2_IRQHandler(void);
WEAK void OCOTP_IRQHandler(void);

//*****************************************************************************
// Forward declaration of the driver IRQ handlers. These are aliased
// to the IntDefaultHandler, which is a 'forever' loop. When the driver
// defines a handler (with the same name), this will automatically take
// precedence over these weak definitions
//*****************************************************************************
void Reserved16_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void UTICK0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MRT0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CTIMER0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CTIMER1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SCT0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CTIMER3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LP_FLEXCOMM0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LP_FLEXCOMM1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LP_FLEXCOMM2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LP_FLEXCOMM3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LP_FLEXCOMM4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LP_FLEXCOMM5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPSPI14_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPI2C15_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ADC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SDADC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ACMP_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PDM_EVENT_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PDM_HWVAD_EVENT_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void HYPERVISOR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SECURE_VIOLATION_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SENSE_HYPERVISOR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SENSE_SECURE_VIOLATION_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MEDIA_HYPERVISOR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MEDIA_SECURE_VIOLATION_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void RTC0_ALARM_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void RTC0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void HIFI4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MU0_A_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MU1_A_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MU4_A_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CTIMER2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CTIMER4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void OS_EVENT_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LP_FLEXCOMM6_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LP_FLEXCOMM7_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void USDHC0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void USDHC1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void I3C0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void USB0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void USB1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void WDT0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void WDT1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void USBPHY0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PUF_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PMIC_IRQN_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LP_FLEXCOMM8_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LP_FLEXCOMM9_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LP_FLEXCOMM10_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LP_FLEXCOMM11_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LP_FLEXCOMM12_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LP_FLEXCOMM13_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPSPI16_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void I3C1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FLEXIO_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LCDIF_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void VGPU_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MIPI_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA0_CH0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA0_CH1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA0_CH2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA0_CH3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA0_CH4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA0_CH5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA0_CH6_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA0_CH7_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA0_CH8_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA0_CH9_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA0_CH10_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA0_CH11_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA0_CH12_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA0_CH13_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA0_CH14_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA0_CH15_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA1_CH0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA1_CH1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA1_CH2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA1_CH3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA1_CH4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA1_CH5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA1_CH6_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA1_CH7_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA1_CH8_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA1_CH9_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA1_CH10_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA1_CH11_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA1_CH12_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA1_CH13_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA1_CH14_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EDMA1_CH15_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO00_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO01_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO10_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO11_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO20_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO21_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO30_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO31_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO40_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO41_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO50_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO51_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO60_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO61_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO70_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GPIO71_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PIN_INT0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PIN_INT1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PIN_INT2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PIN_INT3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PIN_INT4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PIN_INT5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PIN_INT6_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PIN_INT7_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SAI0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SAI1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SAI2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void XSPI0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void XSPI1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void XSPI2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MMU0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MMU1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MMU2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Freqme_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GDET0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GDET1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GDET2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GDET3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CDOG0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CDOG1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CDOG2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ITRC0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ELS_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PKC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void OSCCA_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SLEEPCON0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CPU0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PMC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void JPEGDEC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PNGDEC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void NPU_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TRNG_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TEMPDET0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void TEMPDET1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void EZHV_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GLIKEY0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GLIKEY2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GLIKEY3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void GLIKEY5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PVTS0_CPU0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved167_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PVTS0_HIFI4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved169_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FRO0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FRO1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FRO2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void OCOTP_DriverIRQHandler(void) ALIAS(IntDefaultHandler);

//*****************************************************************************
// The entry point for the application.
// __main() is the entry point for Redlib based applications
// main() is the entry point for Newlib based applications
//*****************************************************************************
#if defined (__REDLIB__)
extern void __main(void);
#endif
extern int main(void);

//*****************************************************************************
// External declaration for the pointer to the stack top from the Linker Script
//*****************************************************************************
extern void _vStackTop(void);
extern void _image_size(void);
//*****************************************************************************
// External declaration for the pointer to the stack base from the Linker Script
//*****************************************************************************
extern void _vStackBase(void);
//*****************************************************************************
// External declaration for image type and load address from  Linker Script
//*****************************************************************************
WEAK extern void __imghdr_loadaddress();
WEAK extern void __imghdr_imagetype();

//*****************************************************************************
#if defined (__cplusplus)
} // extern "C"
#endif
//*****************************************************************************
// The vector table.
// This relies on the linker script to place at correct location in memory.
//*****************************************************************************

