nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/mcuxpresso/startup_mimxrt798s_cm33_core0.cpp
WEAK void LP_FLEXCOMM8_IRQHandler(void)
{   LP_FLEXCOMM8_DriverIRQHandler();
}

WEAK void LP_FLEXCOMM9_IRQHandler(void)
{   LP_FLEXCOMM9_DriverIRQHandler();
}

WEAK void LP_FLEXCOMM10_IRQHandler(void)
{   LP_FLEXCOMM10_DriverIRQHandler();
}

WEAK void LP_FLEXCOMM11_IRQHandler(void)
{   LP_FLEXCOMM11_DriverIRQHandler();
}

WEAK void LP_FLEXCOMM12_IRQHandler(void)
{   LP_FLEXCOMM12_DriverIRQHandler();
}

WEAK void LP_FLEXCOMM13_IRQHandler(void)
{   LP_FLEXCOMM13_DriverIRQHandler();
}

WEAK void LPSPI16_IRQHandler(void)
{   LPSPI16_DriverIRQHandler();
}

WEAK void I3C1_IRQHandler(void)
{   I3C1_DriverIRQHandler();
}

WEAK void FLEXIO_IRQHandler(void)
{   FLEXIO_DriverIRQHandler();
}

WEAK void LCDIF_IRQHandler(void)
{   LCDIF_DriverIRQHandler();
}

WEAK void VGPU_IRQHandler(void)
{   VGPU_DriverIRQHandler();
}

WEAK void MIPI_IRQHandler(void)
{   MIPI_DriverIRQHandler();
}

WEAK void EDMA0_CH0_IRQHandler(void)
{   EDMA0_CH0_DriverIRQHandler();
}

WEAK void EDMA0_CH1_IRQHandler(void)
{   EDMA0_CH1_DriverIRQHandler();
}

WEAK void EDMA0_CH2_IRQHandler(void)
{   EDMA0_CH2_DriverIRQHandler();
}

WEAK void EDMA0_CH3_IRQHandler(void)
{   EDMA0_CH3_DriverIRQHandler();
}

WEAK void EDMA0_CH4_IRQHandler(void)
{   EDMA0_CH4_DriverIRQHandler();
}

WEAK void EDMA0_CH5_IRQHandler(void)
{   EDMA0_CH5_DriverIRQHandler();
}

WEAK void EDMA0_CH6_IRQHandler(void)
{   EDMA0_CH6_DriverIRQHandler();
}

WEAK void EDMA0_CH7_IRQHandler(void)
{   EDMA0_CH7_DriverIRQHandler();
}

WEAK void EDMA0_CH8_IRQHandler(void)
{   EDMA0_CH8_DriverIRQHandler();
}

WEAK void EDMA0_CH9_IRQHandler(void)
{   EDMA0_CH9_DriverIRQHandler();
}

WEAK void EDMA0_CH10_IRQHandler(void)
{   EDMA0_CH10_DriverIRQHandler();
}

WEAK void EDMA0_CH11_IRQHandler(void)
{   EDMA0_CH11_DriverIRQHandler();
}

WEAK void EDMA0_CH12_IRQHandler(void)
{   EDMA0_CH12_DriverIRQHandler();
}

WEAK void EDMA0_CH13_IRQHandler(void)
{   EDMA0_CH13_DriverIRQHandler();
}

WEAK void EDMA0_CH14_IRQHandler(void)
{   EDMA0_CH14_DriverIRQHandler();
}

WEAK void EDMA0_CH15_IRQHandler(void)
{   EDMA0_CH15_DriverIRQHandler();
}

WEAK void EDMA1_CH0_IRQHandler(void)
{   EDMA1_CH0_DriverIRQHandler();
}

WEAK void EDMA1_CH1_IRQHandler(void)
{   EDMA1_CH1_DriverIRQHandler();
}

WEAK void EDMA1_CH2_IRQHandler(void)
{   EDMA1_CH2_DriverIRQHandler();
}

WEAK void EDMA1_CH3_IRQHandler(void)
{   EDMA1_CH3_DriverIRQHandler();
}

WEAK void EDMA1_CH4_IRQHandler(void)
{   EDMA1_CH4_DriverIRQHandler();
}

WEAK void EDMA1_CH5_IRQHandler(void)
{   EDMA1_CH5_DriverIRQHandler();
}

WEAK void EDMA1_CH6_IRQHandler(void)
{   EDMA1_CH6_DriverIRQHandler();
}

WEAK void EDMA1_CH7_IRQHandler(void)
{   EDMA1_CH7_DriverIRQHandler();
}

WEAK void EDMA1_CH8_IRQHandler(void)
{   EDMA1_CH8_DriverIRQHandler();
}

WEAK void EDMA1_CH9_IRQHandler(void)
{   EDMA1_CH9_DriverIRQHandler();
}

WEAK void EDMA1_CH10_IRQHandler(void)
{   EDMA1_CH10_DriverIRQHandler();
}

WEAK void EDMA1_CH11_IRQHandler(void)
{   EDMA1_CH11_DriverIRQHandler();
}

WEAK void EDMA1_CH12_IRQHandler(void)
{   EDMA1_CH12_DriverIRQHandler();
}

WEAK void EDMA1_CH13_IRQHandler(void)
{   EDMA1_CH13_DriverIRQHandler();
}

WEAK void EDMA1_CH14_IRQHandler(void)
{   EDMA1_CH14_DriverIRQHandler();
}

WEAK void EDMA1_CH15_IRQHandler(void)
{   EDMA1_CH15_DriverIRQHandler();
}

WEAK void GPIO00_IRQHandler(void)
{   GPIO00_DriverIRQHandler();
}

WEAK void GPIO01_IRQHandler(void)
{   GPIO01_DriverIRQHandler();
}

WEAK void GPIO10_IRQHandler(void)
{   GPIO10_DriverIRQHandler();
}

WEAK void GPIO11_IRQHandler(void)
{   GPIO11_DriverIRQHandler();
}

WEAK void GPIO20_IRQHandler(void)
{   GPIO20_DriverIRQHandler();
}

WEAK void GPIO21_IRQHandler(void)
{   GPIO21_DriverIRQHandler();
}

WEAK void GPIO30_IRQHandler(void)
{   GPIO30_DriverIRQHandler();
}

WEAK void GPIO31_IRQHandler(void)
{   GPIO31_DriverIRQHandler();
}

WEAK void GPIO40_IRQHandler(void)
{   GPIO40_DriverIRQHandler();
}

WEAK void GPIO41_IRQHandler(void)
{   GPIO41_DriverIRQHandler();
}

WEAK void GPIO50_IRQHandler(void)
{   GPIO50_DriverIRQHandler();
}

WEAK void GPIO51_IRQHandler(void)
{   GPIO51_DriverIRQHandler();
}

WEAK void GPIO60_IRQHandler(void)
{   GPIO60_DriverIRQHandler();
}

WEAK void GPIO61_IRQHandler(void)
{   GPIO61_DriverIRQHandler();
}

WEAK void GPIO70_IRQHandler(void)
{   GPIO70_DriverIRQHandler();
}

WEAK void GPIO71_IRQHandler(void)
{   GPIO71_DriverIRQHandler();
}

WEAK void PIN_INT0_IRQHandler(void)
{   PIN_INT0_DriverIRQHandler();
}

WEAK void PIN_INT1_IRQHandler(void)
{   PIN_INT1_DriverIRQHandler();
}

WEAK void PIN_INT2_IRQHandler(void)
{   PIN_INT2_DriverIRQHandler();
}

WEAK void PIN_INT3_IRQHandler(void)
{   PIN_INT3_DriverIRQHandler();
}

WEAK void PIN_INT4_IRQHandler(void)
{   PIN_INT4_DriverIRQHandler();
}

WEAK void PIN_INT5_IRQHandler(void)
{   PIN_INT5_DriverIRQHandler();
}

WEAK void PIN_INT6_IRQHandler(void)
{   PIN_INT6_DriverIRQHandler();
}

WEAK void PIN_INT7_IRQHandler(void)
{   PIN_INT7_DriverIRQHandler();
}

WEAK void SAI0_IRQHandler(void)
{   SAI0_DriverIRQHandler();
}

WEAK void SAI1_IRQHandler(void)
{   SAI1_DriverIRQHandler();
}

WEAK void SAI2_IRQHandler(void)
{   SAI2_DriverIRQHandler();
}

WEAK void XSPI0_IRQHandler(void)
{   XSPI0_DriverIRQHandler();
}

WEAK void XSPI1_IRQHandler(void)
{   XSPI1_DriverIRQHandler();
}

WEAK void XSPI2_IRQHandler(void)
{   XSPI2_DriverIRQHandler();
}

WEAK void MMU0_IRQHandler(void)
{   MMU0_DriverIRQHandler();
}

WEAK void MMU1_IRQHandler(void)
{   MMU1_DriverIRQHandler();
}

WEAK void MMU2_IRQHandler(void)
{   MMU2_DriverIRQHandler();
}

WEAK void Freqme_IRQHandler(void)
{   Freqme_DriverIRQHandler();
}

WEAK void GDET0_IRQHandler(void)
{   GDET0_DriverIRQHandler();
}

WEAK void GDET1_IRQHandler(void)
{   GDET1_DriverIRQHandler();
}

WEAK void GDET2_IRQHandler(void)
{   GDET2_DriverIRQHandler();
}

WEAK void GDET3_IRQHandler(void)
{   GDET3_DriverIRQHandler();
}

WEAK void CDOG0_IRQHandler(void)
{   CDOG0_DriverIRQHandler();
}

WEAK void CDOG1_IRQHandler(void)
{   CDOG1_DriverIRQHandler();
}

WEAK void CDOG2_IRQHandler(void)
{   CDOG2_DriverIRQHandler();
}

WEAK void ITRC0_IRQHandler(void)
{   ITRC0_DriverIRQHandler();
}

