nxp-mcuxpresso/mcux-sdk/devices/MIMXRT798S/mcuxpresso/startup_mimxrt798s_cm33_core0.cpp
WEAK void ELS_IRQHandler(void)
{   ELS_DriverIRQHandler();
}

WEAK void PKC_IRQHandler(void)
{   PKC_DriverIRQHandler();
}

WEAK void OSCCA_IRQHandler(void)
{   OSCCA_DriverIRQHandler();
}

WEAK void SLEEPCON0_IRQHandler(void)
{   SLEEPCON0_DriverIRQHandler();
}

WEAK void CPU0_IRQHandler(void)
{   CPU0_DriverIRQHandler();
}

WEAK void PMC_IRQHandler(void)
{   PMC_DriverIRQHandler();
}

WEAK void JPEGDEC_IRQHandler(void)
{   JPEGDEC_DriverIRQHandler();
}

WEAK void PNGDEC_IRQHandler(void)
{   PNGDEC_DriverIRQHandler();
}

WEAK void NPU_IRQHandler(void)
{   NPU_DriverIRQHandler();
}

WEAK void TRNG_IRQHandler(void)
{   TRNG_DriverIRQHandler();
}

WEAK void TEMPDET0_IRQHandler(void)
{   TEMPDET0_DriverIRQHandler();
}

WEAK void TEMPDET1_IRQHandler(void)
{   TEMPDET1_DriverIRQHandler();
}

WEAK void EZHV_IRQHandler(void)
{   EZHV_DriverIRQHandler();
}

WEAK void GLIKEY0_IRQHandler(void)
{   GLIKEY0_DriverIRQHandler();
}

WEAK void GLIKEY2_IRQHandler(void)
{   GLIKEY2_DriverIRQHandler();
}

WEAK void GLIKEY3_IRQHandler(void)
{   GLIKEY3_DriverIRQHandler();
}

WEAK void GLIKEY5_IRQHandler(void)
{   GLIKEY5_DriverIRQHandler();
}

WEAK void PVTS0_CPU0_IRQHandler(void)
{   PVTS0_CPU0_DriverIRQHandler();
}

WEAK void Reserved167_IRQHandler(void)
{   Reserved167_DriverIRQHandler();
}

WEAK void PVTS0_HIFI4_IRQHandler(void)
{   PVTS0_HIFI4_DriverIRQHandler();
}

WEAK void Reserved169_IRQHandler(void)
{   Reserved169_DriverIRQHandler();
}

WEAK void FRO0_IRQHandler(void)
{   FRO0_DriverIRQHandler();
}

WEAK void FRO1_IRQHandler(void)
{   FRO1_DriverIRQHandler();
}

WEAK void FRO2_IRQHandler(void)
{   FRO2_DriverIRQHandler();
}

WEAK void OCOTP_IRQHandler(void)
{   OCOTP_DriverIRQHandler();
}

//*****************************************************************************

#if defined (DEBUG)
#pragma GCC pop_options
#endif // (DEBUG)
